Python 3.5.0 (v3.5.0:374f501f4567, Sep 13 2015, 02:16:59) [MSC v.1900 32 bit (Intel)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> # 1.11001110101를 8진수로바꾸세요.








#2.농도가8%인 소금물 600g이 있다.소금의양을 구하시오
#3.267387을 123으로 나누엇을때 나머지를 구하시오
>>> # 1.11001110101를 8진수로바꾸세요.








#2.농도가8%인 소금물 600g이 있다.소금의양을 구하시오
#3.267387을 123으로 나누엇을때 나머지를 구하시오

>>> 

>>> 
>>> 
=============================== RESTART: Shell ===============================
>>> # 1.11001110101를 8진수로바꾸세요
>>> 0b11001110101
1653
>>> oct(1653)
'0o3165'
>>> 
>>> 
>>> #2. 농도가8%인 소금물 600g이 있다.소금의양을 구하시오
>>> percent = 8
>>> salt_water = 600
>>> salt = percent*salt_water/100
>>> print(salt)
48.0
>>> 
>>> #3. 267387을 123으로 나누엇을때 나머지를 구하시오
>>> 267387%123
108
>>> 
